app/views/prestantes/_form.html.erb

SELECT "categorias".* FROM "categorias"
---
        <div class="col-12">
          <%= f.input :categoria_id, as: :select, collection: Categoria.all, label_method: :nome, value_method: :id, prompt: "Selecione uma categoria", input_html: { class: "form-control", title: "Informe categoria" } %>