app/controllers/categorias_controller.rb

INSERT INTO "categorias" ("nome", "descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "categorias" ("nome", "descricao", "estabelecimento_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Bebidas"], ["descricao", "Bebidas frescas"], ["estabelecimento_id", nil], ["created_at", "2025-01-29 04:52:38.888466"], ["updated_at", "2025-01-29 04:52:38.888466"]]
---
  def create
    @categoria = Categoria.new(categoria_params)

    if @categoria.save
      redirect_to categorias_path, notice: t('messages.created_successfully')