app/controllers/funcoes_controller.rb

INSERT INTO "funcoes" ("nome", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "ADMINISTRADOR"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-01-28 22:36:18.537182"], ["updated_at", "2025-01-28 22:36:18.537182"]]
---
  def create
    @funcao = Funcao.new(funcao_params)

    if @funcao.save
      redirect_to funcoes_path, notice: t('messages.created_successfully')

UPDATE "funcoes" SET "nome" = $1, "updated_at" = $2 WHERE "funcoes"."id" = $3  [["nome", "ADMINISTRADOR "], ["updated_at", "2025-01-28 22:36:38.958351"], ["id", 1]]
---
  def update
    if @funcao.update(funcao_params)
      redirect_to funcoes_path, notice: t('messages.updated_successfully'), status: :see_other

DELETE FROM "funcoes" WHERE "funcoes"."id" = $1  [["id", 1]]
---
  def destroy
    if @funcao.destroy
      redirect_to funcoes_url, notice: t('messages.deleted_successfully')