app/controllers/prestantes_controller.rb

INSERT INTO "prestantes" ("nome", "categoria_id", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["nome", "a"], ["categoria_id", 1], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-02-15 19:41:18.874504"], ["updated_at", "2025-02-15 19:41:18.874504"]]
---
  def create
    @prestante = Prestante.new(prestante_params)

    if @prestante.save